IDENTIFICATION DIVISION.
PROGRAM-ID. COBOLFETCH.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT CPUFILE
        ASSIGN TO "/proc/cpuinfo"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.


FILE SECTION.

FD CPUFILE.
01 CPU-LINE PIC X(256).

WORKING-STORAGE SECTION.

01 UTSNAME.
    05 OS-NAME      PIC X(65).
    05 NODE-NAME    PIC X(65).
    05 OS-RELEASE   PIC X(65).
    05 OS-VERSION   PIC X(65).
    05 MACHINE      PIC X(65).
    05 DOMAIN-NAME  PIC X(65).
    
01 OSRESULT PIC S9(9) COMP-5.


PROCEDURE DIVISION.

        OPEN INPUT CPUFILE.

    READ CPUFILE
        AT END
            DISPLAY "File empty."
        NOT AT END
            DISPLAY CPU-LINE
    END-READ.

    CLOSE CPUFILE.

    CALL "uname"
        USING BY REFERENCE UTSNAME
        RETURNING OSRESULT.
        
    DISPLAY "Hostname: ", NODE-NAME.
    DISPLAY "OS: ", OS-NAME.
    DISPLAY "Kernel: ", OS-RELEASE.
    DISPLAY "CPU: I WILL DO IT. ".
    DISPLAY "Arch: ", MACHINE.
    STOP RUN.