IDENTIFICATION DIVISION.
PROGRAM-ID. COBOLFETCH.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 UTSNAME.
    05 OS-NAME      PIC X(65).
    05 NODE-NAME    PIC X(65).
    05 OS-RELEASE   PIC X(65).
    05 OS-VERSION   PIC X(65).
    05 MACHINE      PIC X(65).
    
01 OSRESULT PIC S9(9) COMP-5.


PROCEDURE DIVISION.
    CALL "uname"
        USING BY REFERENCE UTSNAME
        RETURNING OSRESULT.
        
    DISPLAY "Hostname: ", NODE-NAME.
    DISPLAY "OS: ", OS-NAME.
    DISPLAY "Kernel: ", OS-RELEASE.
    STOP RUN.