IDENTIFICATION DIVISION.
PROGRAM-ID. COBOLFETCH.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 HOSTNAME PIC X(256).
01 HOSTLEN PIC 9(9) COMP-5 VALUE 256.
01 HOSTRESULT PIC S9(9) COMP-5.

01 OS PIC X(390).
01 OSRESULT PIC S9(9) COMP-5.


PROCEDURE DIVISION.
    CALL "uname"
        USING BY REFERENCE OS
        RETURNING OSRESULT.

    CALL "gethostname"
        USING BY REFERENCE HOSTNAME
            BY VALUE HOSTLEN
        RETURNING HOSTRESULT.
        
    DISPLAY "Hostname: ", HOSTNAME.
    DISPLAY "OS: ", OS.
    STOP RUN.